mbsp/mbsportal-services/mbs-portal-ods-adapter/src/test/resources/test_br_message_full.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<fnm:metadata xmlns:fnm="http://www.fanniemae.com/all"
			persist="true" split="false" version="1.0">
			<fnm:payloadIdentifier ID="DEFAULT" mask="false">
				<fnm:eventType>TRDCRE</fnm:eventType>
				<fnm:entityType>trade</fnm:entityType>
				<fnm:entityID>7033</fnm:entityID>
			</fnm:payloadIdentifier>
			<fnm:credential>
				<fnm:source>NONE</fnm:source>
				<fnm:initiatingUserID>NONE</fnm:initiatingUserID>
			</fnm:credential>
			<fnm:system>
				<fnm:producer>bpydev1</fnm:producer>
				<fnm:hostID>dlfapt-ap64.fanniemae.com/10.215.107.81</fnm:hostID>
				<fnm:applicationID>SECURITIESODS</fnm:applicationID>
			</fnm:system>
			<fnm:transaction transactionDomain="DEVL">
				<fnm:messageID>15c4702859aa42fcae241f12b6b44453</fnm:messageID>
				<fnm:timestamp>08/23/2017 11:44:33:321</fnm:timestamp>
			</fnm:transaction>
			<fnm:properties>
				<fnm:property name="PAYLOAD_TYPE">XML</fnm:property>
				<fnm:property name="IS_COMPRESSED">false</fnm:property>
				<fnm:property name="IS_ENCODED">false</fnm:property>
				<fnm:property name="ESB_CLIENT_API_VERSION">4.0.4</fnm:property>
				<fnm:property name="IS_ON_REF_SERVER">false</fnm:property>
				<fnm:property name="UUID" />
			</fnm:properties>
			<fnm:routingProperties>
				<fnm:property name="ODSTransactionType">TRD</fnm:property>
				<fnm:property name="SubportfolioId">713</fnm:property>
				<fnm:property name="SourceSystem">SecODS</fnm:property>
				<fnm:property name="TradeType">EXTERNAL</fnm:property>
				<fnm:property name="ECFVersion">210</fnm:property>
				<fnm:property name="PrimaryTransactionTypeCode">TRD</fnm:property>
			</fnm:routingProperties>
		</fnm:metadata>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<fnm:payload xmlns:fnm="http://www.fanniemae.com/all" ID="DEFAULT">
<ns6:EventMessage ecfVersion="210" xmlns:ns2="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/workStation/v2.1.0" xmlns="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/base/v2.1.0" xmlns:ns4="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/wsRequestResponse/v2.1.0" xmlns:ns3="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/wscommon/v2.1.0" xmlns:ns9="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/wscommon/v2.x" xmlns:ns12="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/eventMessage/v2.x" xmlns:ns5="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/eodSummary/v2.1.0" xmlns:ns6="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/eventMessage/v2.1.0" xmlns:ns10="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/wsRequestResponse/v2.x" xmlns:ns7="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/base/v2.x" xmlns:ns11="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/eodSummary/v2.x" xmlns:ns8="http://www.fanniemae.com/enterprisedata/core/subjectarea/security/workStation/v2.x">
    <ns6:TradeEventMessage>
        <ns6:event>
            <eventId>3473604</eventId>
            <typeCode>TRDCRE</typeCode>
            <name>Trade Confirmed</name>
            <comment>mbstestlender-MBSPCONF</comment>
            <effectiveDate>2017-09-26T14:03:48.000-04:00</effectiveDate>
        </ns6:event>
        <ns6:trade>
            <transactionAgreementTypeCode>TRADE</transactionAgreementTypeCode>
            <transactionBuySellCode>BUY</transactionBuySellCode>
            <transactionAgreementPricePercent>101.80</transactionAgreementPricePercent>
            <transactionAgreementAmount>1200000.00</transactionAgreementAmount>
            <sourceId>BRS</sourceId>
            <subPortfolioId>722</subPortfolioId>
            <sourcePrimaryTradeId>-5690</sourcePrimaryTradeId>
            <subPortfolioShortName>SIT_OPS</subPortfolioShortName>
            <sourceVersionNumber>1</sourceVersionNumber>
            <odsVersionNumber>1</odsVersionNumber>
            <odsTransactionTypeCode>TRD</odsTransactionTypeCode>
            <primaryTransactionTypeCode>TRD</primaryTransactionTypeCode>
            <buySellCode>BUY</buySellCode>
            <toBeAnnouncedStipulatedSpecifiedCode>TBA</toBeAnnouncedStipulatedSpecifiedCode>
            <executionTypeCode>PORT</executionTypeCode>
            <nettingParticipationLevelTypeCode>NONE</nettingParticipationLevelTypeCode>
            <currencyTypeCode>USD</currencyTypeCode>
            <productCusipId>BFN0MP647</productCusipId>
            <cusipTypeCode>INTERNAL</cusipTypeCode>
            <TradeProduct>
                <securityCategoryTypeCode>MBS</securityCategoryTypeCode>
                <securityIssuerCode>FN</securityIssuerCode>
                <collateralHousingTypeCode>SF</collateralHousingTypeCode>
                <financialInstrumentInterestBehaviorCode>FIXED</financialInstrumentInterestBehaviorCode>
                <financialInstrumentMaturityTerm>360</financialInstrumentMaturityTerm>
                <shortDescription>Fannie Mae SF 30 Year Fixed Rate MBS</shortDescription>
            </TradeProduct>
            <tbaCusipId>01F0406A0</tbaCusipId>
            <pricePercent>101.804687500</pricePercent>
            <couponRate>4.000</couponRate>
            <variancePercent>0.010</variancePercent>
            <tradeDate>2017-10-03</tradeDate>
            <settlementDate>2017-10-12</settlementDate>
            <amount>1200000.00</amount>
            <currentFaceAmount>1200000.00</currentFaceAmount>
            <TradeParty>
                <partyId>4342</partyId>
                <enterprisePartyId>966</enterprisePartyId>
                <partyShortName>TEST-C</partyShortName>
                <partyRoleTypeCode>SELLER</partyRoleTypeCode>
                <sourceId>BRS</sourceId>
            </TradeParty>
            <approvedUnderDeliveryAmount>0.00</approvedUnderDeliveryAmount>
            <approvedOverDeliveryAmount>0.00</approvedOverDeliveryAmount>
            <TradeBalance>
                <openBalanceAmount>1200000.00</openBalanceAmount>
                <earlyFundingAllocatedAmount>0.00</earlyFundingAllocatedAmount>
                <nonEarlyFundingAllocatedAmount>0.00</nonEarlyFundingAllocatedAmount>
                <nettedAmount>0.00</nettedAmount>
                <poolNettedAmount>0.00</poolNettedAmount>
                <toBeAnnouncedPairoffAmount>0.00</toBeAnnouncedPairoffAmount>
                <poolPairOffAmount>0.00</poolPairOffAmount>
                <earlyFundingSettledAmount>0.00</earlyFundingSettledAmount>
                <toBeAnnouncedRepriceAmount>0.00</toBeAnnouncedRepriceAmount>
                <nonEarlyFundingSettledAmount>0.00</nonEarlyFundingSettledAmount>
                <contractualUnsettledBalanceAmount>1200000.00</contractualUnsettledBalanceAmount>
                <unsettledBalanceAmount>1200000.00</unsettledBalanceAmount>
            </TradeBalance>
            <TradePayment>
                <principalAmount>1221656.25</principalAmount>
                <interestAmount>1466.67</interestAmount>
                <feeAmount>0.00</feeAmount>
                <feeTypeCode>NONE</feeTypeCode>
            </TradePayment>
            <confirmationStateCode>MANUAL</confirmationStateCode>
            <settlementStateCode>OPEN</settlementStateCode>
            <contractualSettlementStateCode>OPEN</contractualSettlementStateCode>
            <tradeAssignmentIndicator>N</tradeAssignmentIndicator>
            <TradeAttributes>
                <tradeAttributeId>3</tradeAttributeId>
                <name>ORIGINAL_TRD_PARTY_ID</name>
                <operatorCode>EQUAL</operatorCode>
                <value>966</value>
                <dataTypeCode>NUM</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAttributes>
                <tradeAttributeId>4</tradeAttributeId>
                <name>ORIGINAL_TRD_PARTY_SHORT_NAME</name>
                <operatorCode>EQUAL</operatorCode>
                <value>TEST-C</value>
                <dataTypeCode>CHAR</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAttributes>
                <tradeAttributeId>1</tradeAttributeId>
                <name>MBS_TRANS_ID</name>
                <operatorCode>EQUAL</operatorCode>
                <value>MBSP17J00030</value>
                <dataTypeCode>CHAR</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAttributes>
                <tradeAttributeId>2</tradeAttributeId>
                <name>TRD_TYPE</name>
                <operatorCode>EQUAL</operatorCode>
                <value>EXTERNAL</value>
                <dataTypeCode>CHAR</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAttributes>
                <tradeAttributeId>7</tradeAttributeId>
                <name>B2B_TRD_IND</name>
                <operatorCode>EQUAL</operatorCode>
                <value>Y</value>
                <dataTypeCode>CHAR</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAttributes>
                <tradeAttributeId>5</tradeAttributeId>
                <name>ORIGINAL_TRD_PARTY_DESK</name>
                <operatorCode>EQUAL</operatorCode>
                <value>a</value>
                <dataTypeCode>CHAR</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAttributes>
                <tradeAttributeId>6</tradeAttributeId>
                <name>ORIGINAL_TRD_SUBPORT_SHORT_NAME</name>
                <operatorCode>EQUAL</operatorCode>
                <value>SIT_FB1</value>
                <dataTypeCode>CHAR</dataTypeCode>
                <typeCode>LIST</typeCode>
            </TradeAttributes>
            <TradeAccounting>
                <tradeBookIntentTypeCode>AFS</tradeBookIntentTypeCode>
                <tradeTaxIntentTypeCode>HFS</tradeTaxIntentTypeCode>
            </TradeAccounting>
            <traderInitialsText>w8bkrish</traderInitialsText>
            <TradeComments>
                <sequenceNumber>0</sequenceNumber>
                <comment> &lt;SDI&gt; Reference Fund: 709 TdNum: 2758 </comment>
            </TradeComments>
            <settlementLocation>FED</settlementLocation>
            <sourceTransactionEntryDate>2017-09-26T14:02:00.000-04:00</sourceTransactionEntryDate>
            <sourceTransactionEntryUserId>NONE</sourceTransactionEntryUserId>
            <sourceTransactionLastUpdateDate>2017-09-26T14:03:02.603-04:00</sourceTransactionLastUpdateDate>
            <sourceTransactionLastUpdateUserId>tsgops</sourceTransactionLastUpdateUserId>
            <createdOn>2017-09-26T14:03:48.638-04:00</createdOn>
            <lastUpdated>2017-09-26T14:03:48.702-04:00</lastUpdated>
            <logicalDeleteIndicator>N</logicalDeleteIndicator>
        </ns6:trade>
    </ns6:TradeEventMessage>
</ns6:EventMessage>
		</fnm:payload>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>